xzcvczx/mla-legacy/TCPIP WiFi Console Demo App/Alternative Configurations/HardwareProfile PIC32 Starter Kit MRF24WB0M SPI 2.h
	#define BUTTON0_TRIS		(TRISB3)
	#define	BUTTON0_IO			(RB3)
	#define BUTTON1_TRIS		(TRISB2)
	#define	BUTTON1_IO			(RB2)
	#define BUTTON2_TRIS		(TRISB1)
	#define	BUTTON2_IO			(RB1)
	#define BUTTON3_TRIS		(TRISB0)
	#define	BUTTON3_IO			(RB0)

//	// ENC28J60 I/O pins
//	#define ENC_RST_TRIS		(TRISD2)	// Not connected by default
//	#define ENC_RST_IO			(LATD2)
//	//#define ENC_CS_TRIS			(TRISD3)	// Uncomment this line if you wish to use the ENC28J60 on the PICDEM.net 2 board instead of the internal PIC18F97J60 Ethernet module
//	#define ENC_CS_IO			(LATD3)
//	#define ENC_SCK_TRIS		(TRISC3)
//	#define ENC_SDI_TRIS		(TRISC4)
//	#define ENC_SDO_TRIS		(TRISC5)
//	#define ENC_SPI_IF			(SSPIF)
//	#define ENC_SSPBUF			(SSP1BUF)
//	#define ENC_SPISTAT			(SSP1STAT)
//	#define ENC_SPISTATbits		(SSP1STATbits)
//	#define ENC_SPICON1			(SSP1CON1)
//	#define ENC_SPICON1bits		(SSP1CON1bits)
//	#define ENC_SPICON2			(SSP1CON2)

//	// ENC424J600/624J600 Fast 100Mbps Ethernet PICtail Plus defines
//	#define ENC100_INTERFACE_MODE			0	// Uncomment this to use the ENC424J600/624J600 Ethernet controller
//
//	// ENC424J600/624J600 Fast 100Mbps Ethernet PICtail Plus I/O pins
//	#define ENC100_MDIX_TRIS				(TRISB4)
//	#define ENC100_MDIX_IO					(LATB4)
//	#define ENC100_POR_TRIS					(TRISB5)
//	#define ENC100_POR_IO					(LATB5)
//	#define ENC100_INT_TRIS					(TRISB2)
//	#define ENC100_INT_IO					(RB2)
//
//	// ENC424J600/624J600 SPI pinout
//	#define ENC100_CS_TRIS					(TRISB3)
//	#define ENC100_CS_IO					(LATB3)
//	#define ENC100_SO_WR_B0SEL_EN_TRIS		(TRISC4)	// NOTE: SO is ENC624J600 Serial Out, which needs to connect to the PIC SDI pin for SPI mode
//	#define ENC100_SO_WR_B0SEL_EN_IO		(RC4)
//	#define ENC100_SI_RD_RW_TRIS			(TRISC5)	// NOTE: SI is ENC624J600 Serial In, which needs to connect to the PIC SDO pin for SPI mode
//	#define ENC100_SI_RD_RW_IO				(LATC5)
//	#define ENC100_SCK_AL_TRIS				(TRISC3)
//	#define ENC100_SCK_AL_IO				(RC3)		// NOTE: This must be the PORT, not the LATch like it is for the PSP interface.
//
//	// ENC424J600/624J600 SPI SFR register selection (controls which SPI 
//	// peripheral to use on PICs with multiple SPI peripherals).
////	#define ENC100_ISR_ENABLE		(INT2IE)
////	#define ENC100_ISR_FLAG			(INT2IF)
////	#define ENC100_ISR_POLARITY		(INTEDG2)
////	#define ENC100_ISR_PRIORITY		(INT2IP)
//	#define ENC100_SPI_ENABLE		(ENC100_SPISTATbits.SPIEN)
//	#define ENC100_SPI_IF			(PIR1bits.SSP1IF)
//	#define ENC100_SSPBUF			(SSP1BUF)
//	#define ENC100_SPISTAT			(SSP1STAT)
//	#define ENC100_SPISTATbits		(SSP1STATbits)
//	#define ENC100_SPICON1			(SSP1CON1)
//	#define ENC100_SPICON1bits		(SSP1CON1bits)
//	#define ENC100_SPICON2			(SSP1CON2)

//	// 25LC256 I/O pins
//	#define EEPROM_CS_TRIS		(TRISD7)
//	#define EEPROM_CS_IO		(LATD7)
//	#define EEPROM_SCK_TRIS		(TRISC3)
//	#define EEPROM_SDI_TRIS		(TRISC4)
//	#define EEPROM_SDO_TRIS		(TRISC5)
//	#define EEPROM_SPI_IF		(SSP1IF)
//	#define EEPROM_SSPBUF		(SSP1BUF)
//	#define EEPROM_SPICON1		(SSP1CON1)
//	#define EEPROM_SPICON1bits	(SSP1CON1bits)
//	#define EEPROM_SPICON2		(SSP1CON2)
//	#define EEPROM_SPISTAT		(SSP1STAT)
//	#define EEPROM_SPISTATbits	(SSP1STATbits)

	// LCD I/O pins
	#define LCD_DATA_TRIS		(TRISE)
	#define LCD_DATA_IO			(LATE)
	#define LCD_RD_WR_TRIS		(TRISH1)
	#define LCD_RD_WR_IO		(LATH1)
	#define LCD_RS_TRIS			(TRISH2)
	#define LCD_RS_IO			(LATH2)
	#define LCD_E_TRIS			(TRISH0)
	#define LCD_E_IO			(LATH0)

	// Serial Flash/SRAM/UART PICtail
//	#define SPIRAM_CS_TRIS			(TRISB5)
//	#define SPIRAM_CS_IO			(LATB5)
//	#define SPIRAM_SCK_TRIS			(TRISC3)
//	#define SPIRAM_SDI_TRIS			(TRISC4)
//	#define SPIRAM_SDO_TRIS			(TRISC5)
//	#define SPIRAM_SPI_IF			(SSPIF)
//	#define SPIRAM_SSPBUF			(SSP1BUF)
//	#define SPIRAM_SPICON1			(SSP1CON1)
//	#define SPIRAM_SPICON1bits		(SSP1CON1bits)
//	#define SPIRAM_SPICON2			(SSP1CON2)
//	#define SPIRAM_SPISTAT			(SSP1STAT)
//	#define SPIRAM_SPISTATbits		(SSP1STATbits)
//
//	// NOTE: You must also set the SPI_FLASH_SST/SPI_FLASH_SPANSION, 
//	//       SPI_FLASH_SECTOR_SIZE, and SPI_FLASH_PAGE_SIZE macros in 
//	//       SPIFlash.h to match your particular Flash memory chip!!!
//	#define SPIFLASH_CS_TRIS		(TRISB4)
//	#define SPIFLASH_CS_IO			(LATB4)
//	#define SPIFLASH_SCK_TRIS		(TRISC3)
//	#define SPIFLASH_SDI_TRIS		(TRISC4)
//	#define SPIFLASH_SDI_IO			(RC4)
//	#define SPIFLASH_SDO_TRIS		(TRISC5)
//	#define SPIFLASH_SPI_IF			(SSPIF)
//	#define SPIFLASH_SSPBUF			(SSP1BUF)
//	#define SPIFLASH_SPICON1		(SSP1CON1)
//	#define SPIFLASH_SPICON1bits	(SSP1CON1bits)
//	#define SPIFLASH_SPICON2		(SSP1CON2)
//	#define SPIFLASH_SPISTAT		(SSP1STAT)
//	#define SPIFLASH_SPISTATbits	(SSP1STATbits)

	// Register name fixup for certain processors
	#define SPBRGH				SPBRGH1
	#define TXSTAbits			TXSTA1bits
	#define RCSTAbits			RCSTA1bits
	#define BAUDCONbits			BAUDCON1bits
	#define GO					GODONE

#elif defined(INTERNET_RADIO) // Internet Radio board
// Internet Radio board (05-60142)
	// I/O pins
	#define LED0_TRIS			(TRISCbits.TRISC2)
	#define LED0_IO				(LATCbits.LATC2)
	#define LED1_TRIS			(PRODL)				// No LED1 on this board
	#define LED1_IO				(PRODL)
	#define LED2_TRIS			(PRODL)				// No LED2 on this board
	#define LED2_IO				(PRODL)
	#define LED3_TRIS			(PRODL)				// No LED3 on this board
	#define LED3_IO				(PRODL)
	#define LED4_TRIS			(PRODL)				// No LED4 on this board
	#define LED4_IO				(PRODL)
	#define LED5_TRIS			(PRODL)				// No LED5 on this board
	#define LED5_IO				(PRODL)
	#define LED6_TRIS			(PRODL)				// No LED6 on this board
	#define LED6_IO				(PRODL)
	#define LED7_TRIS			(PRODL)				// No LED7 on this board
	#define LED7_IO				(PRODL)
	#define LED_GET()			(LED0_IO)
	#define LED_PUT(a)			(LED0_IO = (a))

	#define BUTTON0_TRIS		(TRISBbits.TRISB5)
	#define	BUTTON0_IO			(PORTBbits.RB5)
	#define BUTTON1_TRIS		(TRISFbits.TRISF1)
	#define	BUTTON1_IO			(PORTFbits.RF1)
	#define BUTTON2_TRIS		(TRISBbits.TRISB4)
	#define	BUTTON2_IO			(PORTBbits.RB4)
	#define BUTTON3_TRIS		(PRODL)				// No BUTTON3 on this board
	#define	BUTTON3_IO			(PRODL)

