xzcvczx/mla-legacy/TCPIP WiFi Console Demo App/Alternative Configurations/HardwareProfile PIC32 Starter Kit MRF24WB0M SPI 2.h
	//----------------------------
	// MRF24WB0M WiFi I/O pins
	//----------------------------
	// If you have a MRF24WB0M WiFi PICtail, you must uncomment one of 
	// these two lines to use it.  SPI1 is the top-most slot while SPI2 corresponds to 
	// insertion of the PICtail into the middle of the side edge connector slot.

	//#define MRF24WB0M_IN_SPI1
	#define MRF24WB0M_IN_SPI2
	#if defined( MRF24WB0M_IN_SPI1 )
		// MRF24WB0M in SPI1 slot
		#define WF_CS_TRIS			(TRISBbits.TRISB2)
    	#define WF_CS_IO			(LATBbits.LATB2)
    	#define WF_SDI_TRIS			(TRISFbits.TRISF7)
    	#define WF_SCK_TRIS			(TRISFbits.TRISF6)
    	#define WF_SDO_TRIS			(TRISFbits.TRISF8)
      	#define WF_RESET_TRIS		(TRISFbits.TRISF0)
    	#define WF_RESET_IO			(LATFbits.LATF0)
    	#define WF_INT_TRIS		    (TRISEbits.TRISE8)  // INT1
    	#define WF_INT_IO			(PORTEbits.RE8)
    	#define WF_HIBERNATE_TRIS   (TRISFbits.TRISF1)
    	#define	WF_HIBERNATE_IO		(PORTFbits.RF1)
       #define WF_INT_EDGE		    (INTCONbits.INT1EP)
       #define WF_INT_IE			(IEC0bits.INT1IE)
       #define WF_INT_IF			(IFS0bits.INT1IF)
       #define WF_INT_IE_CLEAR      IEC0CLR
       #define WF_INT_IF_CLEAR      IFS0CLR
       #define WF_INT_IE_SET        IEC0SET
       #define WF_INT_IF_SET        IFS0SET
       #define WF_INT_BIT           0x00000080
       #define WF_INT_IPCSET        IPC1SET
       #define WF_INT_IPCCLR        IPC1CLR
       #define WF_INT_IPC_MASK      0xFF000000
       #define WF_INT_IPC_VALUE     0x0C000000

    	#define WF_SSPBUF			(SPI1BUF)
    	#define WF_SPISTAT			(SPI1STAT)
    	#define WF_SPISTATbits		(SPI1STATbits)
       #define WF_SPICON1			(SPI1CON)
       #define WF_SPICON1bits		(SPI1CONbits)
       #define WF_SPI_IE_CLEAR     IEC0CLR
       #define WF_SPI_IF_CLEAR     IFS0CLR
       #define WF_SPI_INT_BITS     0x03800000
    	#define WF_SPI_BRG		    (SPI1BRG)
       #define WF_MAX_SPI_FREQ     (10000000ul)	// Hz
		
	#elif defined( MRF24WB0M_IN_SPI2 )
       // MRF24WB0M in SPI2 slot
       #define WF_CS_TRIS			(TRISGbits.TRISG9)
    	#define WF_CS_IO			(LATGbits.LATG9)
    	#define WF_SDI_TRIS			(TRISGbits.TRISG7)
    	#define WF_SCK_TRIS			(TRISGbits.TRISG6)
    	#define WF_SDO_TRIS			(TRISGbits.TRISG8)
      	#define WF_RESET_TRIS		(TRISGbits.TRISG0)
    	#define WF_RESET_IO			(LATGbits.LATG0)
    	#define WF_INT_TRIS		    (TRISAbits.TRISA14) // INT3
    	#define WF_INT_IO			(PORTAbits.RA14)
    	#define WF_HIBERNATE_TRIS   (TRISGbits.TRISG1)
    	#define	WF_HIBERNATE_IO	    (PORTGbits.RG1)
       #define WF_INT_EDGE		    (INTCONbits.INT3EP)
       #define WF_INT_IE			(IEC0bits.INT3IE)
       #define WF_INT_IF			(IFS0bits.INT3IF)
       #define WF_INT_IE_CLEAR      IEC0CLR
       #define WF_INT_IF_CLEAR      IFS0CLR
       #define WF_INT_IE_SET        IEC0SET
       #define WF_INT_IF_SET        IFS0SET
       #define WF_INT_BIT           0x00008000
       #define WF_INT_IPCSET        IPC3SET
       #define WF_INT_IPCCLR        IPC3CLR
       #define WF_INT_IPC_MASK      0xFF000000
       #define WF_INT_IPC_VALUE     0x0C000000
		
    	#define WF_SSPBUF			(SPI2BUF)
    	#define WF_SPISTAT			(SPI2STAT)
    	#define WF_SPISTATbits		(SPI2STATbits)
       #define WF_SPICON1			(SPI2CON)
       #define WF_SPICON1bits		(SPI2CONbits)
       #define WF_SPI_IE_CLEAR     IEC1CLR
       #define WF_SPI_IF_CLEAR     IFS1CLR
       #define WF_SPI_INT_BITS     0x000000e0
    	#define WF_SPI_BRG		    (SPI2BRG)
       #define WF_MAX_SPI_FREQ     (10000000ul)	// Hz
	#endif


#elif defined(PIC32_ENET_SK_DM320004)
// PIC32 Ethernet Starter Kit (04-02146) with PIC32MX795F512L processor and National DP83848 10/100 PHY
	// External SMSC PHY configuration
	#define	PHY_RMII				// external PHY runs in RMII mode
	#define	PHY_CONFIG_ALTERNATE	// alternate configuration used
	#define	PHY_ADDRESS			0x1	// the address of the National DP83848 PHY

    // Hardware mappings
    #define LED0_TRIS			(TRISDbits.TRISD0)	// Ref LED1
	#define LED0_IO				(LATDbits.LATD0)
	#define LED1_TRIS			(TRISDbits.TRISD1)	// Ref LED2
	#define LED1_IO				(LATDbits.LATD1)
	#define LED2_TRIS			(TRISDbits.TRISD2)	// Ref LED3
	#define LED2_IO				(LATDbits.LATD2)
	#define LED3_TRIS			(LED2_TRIS)			// No such LED
	#define LED3_IO				(LATDbits.LATD6)
	#define LED4_TRIS			(LED2_TRIS)			// No such LED
	#define LED4_IO				(LATDbits.LATD6)
	#define LED5_TRIS			(LED2_TRIS)			// No such LED
	#define LED5_IO				(LATDbits.LATD6)
	#define LED6_TRIS			(LED2_TRIS)			// No such LED
	#define LED6_IO				(LATDbits.LATD6)
	#define LED7_TRIS			(LED2_TRIS)			// No such LED
	#define LED7_IO				(LATDbits.LATD6)
	
	#define LED_GET()			((BYTE)LATD & 0x07)
	#define LED_PUT(a)			do{LATD = (LATD & 0xFFF8) | ((a)&0x07);}while(0)

    #define BUTTON0_TRIS		(TRISDbits.TRISD6)	// Ref SW1
	#define	BUTTON0_IO			(PORTDbits.RD6)
	#define BUTTON1_TRIS		(TRISDbits.TRISD7)	// Ref SW2
	#define	BUTTON1_IO			(PORTDbits.RD7)
	#define BUTTON2_TRIS		(TRISDbits.TRISD13)	// Ref SW3
	#define	BUTTON2_IO			(PORTDbits.RD13)
	#define BUTTON3_TRIS		(TRISDbits.TRISD13)	// No BUTTON3 on this board
	#define	BUTTON3_IO			(1)


	// Note, it is not possible to use a MRF24WB0M 802.11 WiFi PICtail 
	// Plus card with this starter kit.  The required interrupt signal, among 
	// possibly other I/O pins aren't available on the Starter Kit board.  

#elif defined(PIC24FJ256DA210_DEV_BOARD)
// PIC24FJ256DA210 Development Board (Graphics) + 
//   Fast 100Mbps Ethernet PICtail Plus or Ethernet PICtail Plus or MRF24WB0M WiFi PICtail Plus

	#define LED0_TRIS			(TRISAbits.TRISA7)		// Ref D4: Jumper JP11 must have a shunt shorting pins 1 and 2 together
	#define LED0_IO				(LATAbits.LATA7)
	#define LED1_TRIS			(((BYTE*)&NVMKEY)[1])	// No such LED, map to dummy register.  D3 is the natural choice for LED0, but the D3 pin (RB5) is multiplexed with R3 potentiometer and MDIX signal on Fast 100Mbps Ethernet PICtail Plus, so it cannot be used
	#define LED1_IO				(((BYTE*)&NVMKEY)[1])
	#define LED2_TRIS			(TRISEbits.TRISE9)		// Ref D2.  NOTE: When using the PSP interface, this RE9 signal also controls the POR (SHDN) signal on the Fast 100Mbps Ethernet PICtail Plus.
	#define LED2_IO				(LATEbits.LATE9)
	#define LED3_TRIS			(TRISGbits.TRISG8)		// Ref D1.  NOTE: When using the PSP interface, this RG8 signal also controls the CS signal on the Fast 100Mbps Ethernet PICtail Plus.
	#define LED3_IO				(LATGbits.LATG8)
	#define LED4_TRIS			(((BYTE*)&NVMKEY)[1])	// No such LED, map to dummy register
	#define LED4_IO				(((BYTE*)&NVMKEY)[1])
	#define LED5_TRIS			(((BYTE*)&NVMKEY)[1])	// No such LED, map to dummy register
	#define LED5_IO				(((BYTE*)&NVMKEY)[1])
	#define LED6_TRIS			(((BYTE*)&NVMKEY)[1])	// No such LED, map to dummy register
	#define LED6_IO				(((BYTE*)&NVMKEY)[1])
	#define LED7_TRIS			(((BYTE*)&NVMKEY)[1])	// No such LED, map to dummy register
	#define LED7_IO				(((BYTE*)&NVMKEY)[1])
	#define LED_GET()			((LATGbits.LATG8<<3) | (LATEbits.LATE9<<2) | LATAbits.LATA7)
	#define LED_PUT(a)			do{BYTE vTemp = (a); LED0_IO = vTemp&0x1; LED2_IO = vTemp&0x4; LED3_IO = vTemp&0x8;} while(0)


